#Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между
#максимальным и минимальным значением дробной части элементов.


#import random

#arraySize = int(input("Введите количество элементов списка: "))
#amount_fraction = arraySize - 1
#fraction_number = [round(random.uniform(1.1, 12.9), 2)
#for fraction_number in range(amount_fraction)]

#from random import randint
#integerNnumbers = []
#for i in range(arraySize - amount_fraction):
    #integer_numbers.append(randint(1, 10))
#all_number = integerNumbers + fraction_number
#random.shuffle(all_number)

#print("Список вещественных чисел", all_number)

#Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Второй вариант
# a = int(input('Введите число: '))
# print(bin(a))

#третий вариант
#n = int(input())
#print('{0:b}'.format(n))


# задание 3 ДЗ 2 задание:
# lst_multiplied = []
#  if len(numbers) % 2 == 0:
# i = 1
#  while i <= array_size / 2:
#     multiplied = numbers[i - 1] * numbers[-i]
#    lst_multiplied.append(multiplied)
#    i += 1
# print(lst_multiplied)


# ln = len(lst1)
# for i in range(ln):
#  if i >= ln / 2:
#    break
# print(lst1[i] * lst1[-i - 1], end=' ')